romanetsky/ev-olution-server/src_old/Esp32StepSwitchToggleCombAll_ESP_48.cpp
        if (b_any(&e_Sel_data)) {
          if (Vbat->size[0] == loop_ub) {
            i = b_y->size[0];
            b_y->size[0] = Vbat->size[0];
            emxEnsureCapacity_real_T(b_y, i);
            VbatC_data = b_y->data;
            loop_ub = Vbat->size[0];
            for (i = 0; i < loop_ub; i++) {
              VbatC_data[i] = Vbat_data[i] * (double)batAct_data[i];
            }
          } else {
            binary_expand_op_9(b_y, Vbat, batAct_data, &loop_ub);
          }
          d_sort(b_y, iidx);
          iidx_data = iidx->data;
          VbatC_data = b_y->data;
          nx = b_y->size[0] - 1;
          stride_0_1 = 0;
          for (ind2out_size = 0; ind2out_size <= nx; ind2out_size++) {
            if (VbatC_data[ind2out_size] > 0.0) {
              stride_0_1++;
            }
          }
          i = r2->size[0];
          r2->size[0] = stride_0_1;
          emxEnsureCapacity_uint16_T(r2, i);
          r3 = r2->data;
          stride_0_1 = 0;
          for (ind2out_size = 0; ind2out_size <= nx; ind2out_size++) {
            if (VbatC_data[ind2out_size] > 0.0) {
              r3[stride_0_1] = (unsigned short)ind2out_size;
              stride_0_1++;
            }
          }
          i = sVbat0->size[0];
          sVbat0->size[0] = r2->size[0];
          emxEnsureCapacity_real_T(sVbat0, i);
          sVbat0_data = sVbat0->data;
          loop_ub = r2->size[0];
          for (i = 0; i < loop_ub; i++) {
            sVbat0_data[i] = VbatC_data[r3[i]];
          }
          useConstantDim(sVbat0, nonSingletonDim(sVbat0));
          sVbat0_data = sVbat0->data;
          Nact = r2->size[0];
          switch (VthFlag) {
          case 1:
            b_ind2out_size = sVbat0->size[0];
            loop_ub = sVbat0->size[0];
            for (i = 0; i < loop_ub; i++) {
              b_ind2out_data[i] = (sVbat0_data[i] > prmSeq.VthUnChr);
            }
            stride_0_1 = b_ind2out_size;
            loop_ub = b_ind2out_size;
            for (i = 0; i < loop_ub; i++) {
              tmp_data[i] =
                  (b_ind2out_data[i] && (sVbat0_data[i] < prmSeq.VthChr));
            }
            nx = g_eml_find(tmp_data, stride_0_1, (int *)&findId0_data);
            if (nx == 0) {
              loop_ub = b_ind2out_size;
              for (i = 0; i < loop_ub; i++) {
                b_ind2out_data[i] =
                    (b_ind2out_data[i] && (sVbat0_data[i] < prmSeq.VthOvChr));
              }
              g_eml_find(b_ind2out_data, b_ind2out_size, (int *)&findId0_data);
            }
            /*                      findId0 = find(csVbat<VthChr,1,'last'); */
            /*                      findIdUn = find(csVbat>VthUnChr,1,'first');
             */
            /*                      findId = max(findId,findIdUn); */
            i = ind2Stay->size[0];
            ind2Stay->size[0] = findId0_data;
            emxEnsureCapacity_int32_T(ind2Stay, i);
            ind2Stay_data = ind2Stay->data;
            for (i = 0; i < findId0_data; i++) {
              ind2Stay_data[i] = iidx_data[r3[i]];
            }
            break;
          case 2:
            b_ind2out_size = sVbat0->size[0];
            loop_ub = sVbat0->size[0];
            for (i = 0; i < loop_ub; i++) {
              b_ind2out_data[i] = (sVbat0_data[i] < prmSeq.VthChr);
            }
            /*                      findId0 = find(csVbat<VthChr,1,'last'); */
            /*                      findIdUn = find(csVbat>VthUnChr,1,'first');
             */
            /*                      findId = max(findId,findIdUn); */
            h_eml_find(b_ind2out_data, b_ind2out_size, (int *)&k_ina219);
            /*                          if ~isempty(findId) */
            /*                              firstBigUnder =
             * find(csVbat>VthUnChr,1,'first'); */
            /*                              lastThOver  =
             * find(csVbat<VthChr,1,'last'); */
            /*                              lastLessOver  =
             * find(csVbat<VthOvChr,1,'last'); */
            /*                              if isempty(firstBigUnder) */
            /*                                  firstBigUnder = lastThOver; */
            /*                              end */
            /*                              findId =
             * min(lastThOver,firstBigUnder); */
            /*                              if csVbat(findId)<VthUnChr */
            ind2out_size = 0;
            exitg1 = false;
            while ((!exitg1) && (ind2out_size < 3)) {
              b_k_ina219 = (double)k_ina219 + (double)ind2out_size;
              if (b_k_ina219 + 6.0 <= Nact) {
                i = (int)(b_k_ina219 + 6.0);
              } else {
                i = Nact;
              }
              if (i < 1) {
                loop_ub = 0;
              } else {
                loop_ub = i;
              }
              i = b_y->size[0];
              b_y->size[0] = loop_ub;
              emxEnsureCapacity_real_T(b_y, i);
              VbatC_data = b_y->data;
              for (i = 0; i < loop_ub; i++) {
                VbatC_data[i] = iidx_data[r3[i]];
              }
              nchoosek(b_y, b_k_ina219, C);
              C_data = C->data;
              i = VbatC->size[0] * VbatC->size[1];
              VbatC->size[0] = C->size[0];
              VbatC->size[1] = C->size[1];
              emxEnsureCapacity_real_T(VbatC, i);
              VbatC_data = VbatC->data;
              loop_ub = C->size[0] * C->size[1];
              for (i = 0; i < loop_ub; i++) {
                VbatC_data[i] = Vbat_data[(int)C_data[i] - 1];
              }
              sum(VbatC, Vc);
              sVbat0_data = Vc->data;
              i = c_x->size[0];
              c_x->size[0] = Vc->size[0];
              emxEnsureCapacity_real32_T(c_x, i);
              b_x_data = c_x->data;
              loop_ub = Vc->size[0];
              for (i = 0; i < loop_ub; i++) {
                b_x_data[i] = (float)sVbat0_data[i] - prmSeq.VthChr;
              }
              nx = c_x->size[0];
              i = d_y->size[0];
              d_y->size[0] = c_x->size[0];
              emxEnsureCapacity_real32_T(d_y, i);
              b_y_data = d_y->data;
              for (stride_0_1 = 0; stride_0_1 < nx; stride_0_1++) {
                b_y_data[stride_0_1] = (float)fabs(b_x_data[stride_0_1]);
              }
              b_minimum(d_y, &nx);
              k_nc = nx - 1;
              /*                                      for k_nc = 1:NC */
              /*                                          idC =
               * (Vc(k_nc,:)<VthChr&Vc(k_nc,:)>VthUnChr,1); */
              b_k_ina219 = sVbat0_data[nx - 1];
              if ((b_k_ina219 > prmSeq.VthUnChr) &&
                  (b_k_ina219 < prmSeq.VthOvChr)) {
                exitg1 = true;
              } else {
                /*                                      end */
                ind2out_size++;
              }
            }
            i = ind2Stay->size[0];
            ind2Stay->size[0] = C->size[1];
            emxEnsureCapacity_int32_T(ind2Stay, i);
            ind2Stay_data = ind2Stay->data;
            loop_ub = C->size[1];
            for (i = 0; i < loop_ub; i++) {
              ind2Stay_data[i] = (int)C_data[k_nc + C->size[0] * i];
            }
            /*                              end */
            /*                          end */
            break;
          case 0:
            /* toggle */
            b_k_ina219 = rt_roundd_snf((double)prmBrd_Nbat * Nina219 -
                                       (double)prmCnfg_NtoggleDrop);
            if (b_k_ina219 < 32768.0) {
              if (b_k_ina219 >= -32768.0) {
                e_y = (short)b_k_ina219;
              } else {
                e_y = MIN_int16_T;
              }
            } else if (b_k_ina219 >= 32768.0) {
              e_y = MAX_int16_T;
            } else {
              e_y = 0;
            }
            if (r2->size[0] <= e_y) {
              e_y = (short)r2->size[0];
            }
            if (e_y < 1) {
              loop_ub = 0;
            } else {
              loop_ub = e_y;
            }
            i = ind2Stay->size[0];
            ind2Stay->size[0] = loop_ub;
            emxEnsureCapacity_int32_T(ind2Stay, i);
            ind2Stay_data = ind2Stay->data;
            for (i = 0; i < loop_ub; i++) {
              ind2Stay_data[i] = iidx_data[r3[i]];
            }
            break;
          default:
            i = ind2Stay->size[0];
            ind2Stay->size[0] = 1;
            emxEnsureCapacity_int32_T(ind2Stay, i);
            ind2Stay_data = ind2Stay->data;
            ind2Stay_data[0] = 0;
            break;
          }
        } else {
          i = ind2Stay->size[0];
          ind2Stay->size[0] = 1;
          emxEnsureCapacity_int32_T(ind2Stay, i);
          ind2Stay_data = ind2Stay->data;
          ind2Stay_data[0] = 0;
        }
      }
      if ((int)Nina219 - 1 >= 0) {
        if (prmBrd_Nbat < 1) {
          c_y->size[0] = 1;
          c_y->size[1] = 0;
        } else {
          i = c_y->size[0] * c_y->size[1];
          c_y->size[0] = 1;
          c_y->size[1] = prmBrd_Nbat;
          emxEnsureCapacity_uint16_T(c_y, i);
          y_data = c_y->data;
          loop_ub = prmBrd_Nbat - 1;
          for (i = 0; i <= loop_ub; i++) {
            y_data[i] = (unsigned short)((unsigned int)i + 1U);
          }
        }
        b_loop_ub = c_y->size[1];
        end = ind2Stay->size[0] - 1;
      }
      for (k_ina219 = 0; k_ina219 < loop_ub_tmp; k_ina219++) {
        /*  BattConfigAct{k_ina219} = batAct([1:Nbat]+(k_ina219-1)*Nbat); */
        b_k_ina219 = (((double)k_ina219 + 1.0) - 1.0) * (double)prmBrd_Nbat;
        for (i = 0; i < b_loop_ub; i++) {
          ind2out_data[i] =
              batAct_data[(int)((double)y_data[i] + b_k_ina219) - 1];
        }
        loop_ub = BattConfigAct_size[0];
        for (i = 0; i < loop_ub; i++) {
          BattConfigAct_data[i + BattConfigAct_size[0] * k_ina219] =
              ind2out_data[i];
        }
        stride_0_1 = 0;
        for (ind2out_size = 0; ind2out_size <= end; ind2out_size++) {
          i = ind2Stay_data[ind2out_size];
          if ((b_k_ina219 + 1.0 <= i) &&
              (i <= (double)prmBrd_Nbat + b_k_ina219)) {
            stride_0_1++;
          }
        }
        i = BattConfigPerInaNew->size[0];
        BattConfigPerInaNew->size[0] = stride_0_1;
        emxEnsureCapacity_real_T(BattConfigPerInaNew, i);
        VbatC_data = BattConfigPerInaNew->data;
        stride_0_1 = 0;
        for (ind2out_size = 0; ind2out_size <= end; ind2out_size++) {
          i = ind2Stay_data[ind2out_size];
          if ((b_k_ina219 + 1.0 <= i) &&
              (i <= (double)prmBrd_Nbat + b_k_ina219)) {
            VbatC_data[stride_0_1] = i;
            stride_0_1++;
          }
        }
        e_sort(BattConfigPerInaNew);
        VbatC_data = BattConfigPerInaNew->data;
        loop_ub = BattConfigPerInaNew->size[0];
        for (i = 0; i < loop_ub; i++) {
          VbatC_data[i] -= b_k_ina219;
        }
        i = b_BattConfigPerIna->size[0] * b_BattConfigPerIna->size[1] *
            b_BattConfigPerIna->size[2];
        b_BattConfigPerIna->size[0] = 1;
        b_BattConfigPerIna->size[1] = BattConfigPerIna->size[1];
        loop_ub = BattConfigPerIna->size[2];
        b_BattConfigPerIna->size[2] = loop_ub;
        emxEnsureCapacity_real_T(b_BattConfigPerIna, i);
        VbatC_data = b_BattConfigPerIna->data;
        for (i = 0; i < loop_ub; i++) {
          nx = BattConfigPerIna->size[1];
          for (ind2out_size = 0; ind2out_size < nx; ind2out_size++) {
            VbatC_data[ind2out_size + b_BattConfigPerIna->size[1] * i] =
                BattConfigPerIna_data[(k_ina219 + BattConfigPerIna->size[0] *
                                                      ind2out_size) +
                                      BattConfigPerIna->size[0] *
                                          BattConfigPerIna->size[1] * i];
          }
        }
        remPadArr(b_BattConfigPerIna, r);
        if (!isequal(r, BattConfigPerInaNew)) {
          if (BattConfigPerInaNew->size[0] != 0) {
            padArr(BattConfigPerInaNew, prmBrd_Nbat, prmBrd_Nbat, r);
            VbatC_data = r->data;
            nx = BattConfigPerIna->size[1];
            stride_0_1 = BattConfigPerIna->size[2];
            for (i = 0; i < stride_0_1; i++) {
              for (ind2out_size = 0; ind2out_size < nx; ind2out_size++) {
                BattConfigPerIna_data[(k_ina219 + BattConfigPerIna->size[0] *
                                                      ind2out_size) +
                                      BattConfigPerIna->size[0] *
                                          BattConfigPerIna->size[1] * i] =
                    VbatC_data[ind2out_size + nx * i];
              }
            }
          } else {
            b_padArr(prmBrd_spi_bypass, prmBrd_Nbat, prmBrd_Nbat, r);
            VbatC_data = r->data;
            nx = BattConfigPerIna->size[1];
            stride_0_1 = BattConfigPerIna->size[2];
            for (i = 0; i < stride_0_1; i++) {
              for (ind2out_size = 0; ind2out_size < nx; ind2out_size++) {
                BattConfigPerIna_data[(k_ina219 + BattConfigPerIna->size[0] *
                                                      ind2out_size) +
                                      BattConfigPerIna->size[0] *
                                          BattConfigPerIna->size[1] * i] =
                    VbatC_data[ind2out_size + nx * i];
              }
            }
          }
          changeConfigFlag_data[k_ina219] = true;
          tLastToggle_data[k_ina219] = t_data[0];
        }
      }
      sumNotBypass = 0U;
      for (k_ina219 = 0; k_ina219 < loop_ub_tmp; k_ina219++) {
        if (BattConfigPerIna_data[k_ina219] != prmBrd_spi_bypass) {
          /* >0 */
          sumNotBypass++;
        }
      }
      if ((double)sumNotBypass < prmCnfg_minLenIna219) {
        /* ||SwitchToggleFlage% goto charge */
        if (b) {
          nx = Sel_size[1];
          Sel_size[0] = 1;
          for (i = 0; i < nx; i++) {
            Sel_data[i] = 1.0;
          }
          switchFlag = true;
        } else {
          b_Sel_size[0] = 1;
          b_Sel_size[1] = Sel_size[1];
          loop_ub = Sel_size[1];
          for (i = 0; i < loop_ub; i++) {
            b_Sel_data[i] = (Sel_data[i] == 1.0);
          }
          f_Sel_data.data = &b_Sel_data[0];
          f_Sel_data.size = &b_Sel_size[0];
          f_Sel_data.allocatedSize = 2;
          f_Sel_data.numDimensions = 2;
          f_Sel_data.canFreeData = false;
          if (b_any(&f_Sel_data)) {
            nx = Sel_size[1];
            Sel_size[0] = 1;
            for (i = 0; i < nx; i++) {
              Sel_data[i] = 1.5;
            }
            switchFlag = true;
          } else {
            b_Sel_size[0] = 1;
            b_Sel_size[1] = Sel_size[1];
            loop_ub = Sel_size[1];
            for (i = 0; i < loop_ub; i++) {
              b_Sel_data[i] = (Sel_data[i] == 1.5);
            }
            g_Sel_data.data = &b_Sel_data[0];
            g_Sel_data.size = &b_Sel_size[0];
            g_Sel_data.allocatedSize = 2;
            g_Sel_data.numDimensions = 2;
            g_Sel_data.canFreeData = false;
            if (b_any(&g_Sel_data)) {
              nx = Sel_size[1];
              Sel_size[0] = 1;
              for (i = 0; i < nx; i++) {
                Sel_data[i] = 1.6;
              }
              /* 1.6 */
              switchFlag = true;
            } else {
              b_Sel_size[0] = 1;
              b_Sel_size[1] = Sel_size[1];
              loop_ub = Sel_size[1];
              for (i = 0; i < loop_ub; i++) {
                b_Sel_data[i] = (Sel_data[i] == 1.6);
              }
              h_Sel_data.data = &b_Sel_data[0];
              h_Sel_data.size = &b_Sel_size[0];
              h_Sel_data.allocatedSize = 2;
              h_Sel_data.numDimensions = 2;
              h_Sel_data.canFreeData = false;
              if (b_any(&h_Sel_data)) {
                nx = Sel_size[1];
                Sel_size[0] = 1;
                if (nx - 1 >= 0) {
                  memset(&Sel_data[0], 0, (unsigned int)nx * sizeof(double));
                }
                switchFlag = true;
              }
            }
          }
        }
        nx = (int)Nina219;
        changeConfigFlag_size[0] = 1;
        changeConfigFlag_size[1] = (int)Nina219;
        if (nx - 1 >= 0) {
          memset(&changeConfigFlag_data[0], 0,
                 (unsigned int)nx * sizeof(boolean_T));
        }
        tLastToggle_size[0] = 1;
        tLastToggle_size[1] = t_size[1];
        loop_ub = t_size[1];
        for (i = 0; i < loop_ub; i++) {
          tLastToggle_data[i] = t_data[i];
        }
        for (k_ina219 = 0; k_ina219 < loop_ub_tmp; k_ina219++) {
          loop_ub = BattConfigAct_size[0];
          for (i = 0; i < loop_ub; i++) {
            BattConfigAct_data[i + BattConfigAct_size[0] * k_ina219] = true;
          }
          /* [1:Nbat]'+(k_ina219-1)*Nbat; */
        }
      }
    }
    emxFree_boolean_T(&b_VbatC);
    emxFree_real32_T(&c_x);
    emxFree_real32_T(&d_y);
    emxFree_uint16_T(&c_y);
    emxFree_int32_T(&iidx);
    emxFree_real_T(&b_y);
    emxFree_uint16_T(&r2);
    emxFree_real_T(&VbatC);
    emxFree_real_T(&Vc);
    emxFree_real_T(&C);
    emxFree_int32_T(&ind2Stay);
    emxFree_real_T(&sVbat0);
    emxFree_real_T(&BattConfigPerInaNew);
  }
  emxFree_real_T(&b_BattConfigPerIna);
  emxFree_real_T(&r);
  return switchFlag;
}

